<template>
  <div class="cssanimation sequence fadeInBottom">
    <p class="mt-8 text-2xl font-bold leading-relaxed text-center">
      ความสำคัญสาขาวิชาวิทยาการคอมพิวเตอร์
    </p>
    <p class="mb-8 text-xl font-bold leading-relaxed text-center">
      คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้
    </p>

    <p class="my-6 rem2">
      หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์
      ได้พัฒนาขึ้นเพื่อยกระดับกำลังคนให้เพิ่มขีดความสามารถด้านวิชาการและวิชาชีพในกลุ่มอุตสาหกรรมดิจิทัล
      ตอบสนองการเรียนรู้ในศตวรรษที่ 21
      และกระแสการเปลี่ยนแปลงทางด้านเทคโนโลยีสารสนเทศ
      ซึ่งเป็นไปตามทิศทางการพัฒนาทางด้านเศรษฐกิจและสังคม
      โดยสร้างความเชี่ยวชาญและทักษะที่หลากหลายได้แก่ การพัฒนาระบบอย่างเต็มรูปแบบ
      (Full Stack Developer) วิทยาศาสตร์ข้อมูล (Data Scientist)
      การพัฒนาด้านปัญญาประดิษฐ์ (Artificial Intelligence Engineer)
      และการบริหารจัดการดูแลระบบเครือข่ายคอมพิวเตอร์ (System Administrator)
      อีกทั้งยังสามารถบูรณาการองค์ความรู้โดยเฉพาะอย่างยิ่งทางการเกษตร
      และวิทยาศาสตร์ประยุกต์
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style></style>
