<template>
  <div class="cssanimation sequence fadeInBottom">
    <p class="mt-8 text-2xl font-bold leading-relaxed text-center">
      วัตถุประสงค์สาขาวิชาวิทยาการคอมพิวเตอร์
    </p>
    <p class="mb-8 text-xl font-bold leading-relaxed text-center">
      คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้
    </p>

    <p class="my-6 px-4">
      <b>1)</b>
      ผลิตบัณฑิตที่มีความรู้ความสามารถในวิชาการและวิชาชีพด้านวิทยาการคอมพิวเตอร์
      ที่ทันต่อกระแสการเปลี่ยนแปลงและสอดคล้องกับทิศทางการพัฒนาเศรษฐกิจและสังคม
      ซึ่งสามารถทำงานร่วมกับผู้อื่นได้ดี บนพื้นฐานของคุณธรรม
      จริยธรรมและจรรยาบรรณทางอาชีพ
    </p>

    <p class="my-6 px-4">
      <b>2)</b> ผลิตบัณฑิตที่มีความสามารถในการคิด
      วิเคราะห์ปัญหาและเลือกวิธีการแก้ไขปัญหาเชิงระบบ (Systematic Thinking)
      ได้อย่างเหมาะสม
    </p>

    <p class="my-6 px-4">
      <b>3)</b>
      ผลิตบัณฑิตที่สามารถสร้างสรรค์ผลงานทางด้านวิทยาการคอมพิวเตอร์
      ที่บูรณาการองค์ความรู้ในสาขาวิชาต่างๆ โดยเฉพาะอย่างยิ่งทางการเกษตร
      และวิทยาศาสตร์ประยุกต์
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style></style>
