<template>
  <div class="cssanimation sequence fadeInBottom">
    <p class="mt-8 text-2xl font-bold leading-relaxed text-center">
      ปรัชญาสาขาวิชาวิทยาการคอมพิวเตอร์
    </p>
    <p class="mb-8 text-xl font-bold leading-relaxed text-center">
      คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้
    </p>

    <p class="my-6 rem2">
      ปรัชญาการศึกษาของมหาวิทยาลัยแม่โจ้
      จัดการศึกษาเพื่อเสริมสร้างปัญญาในรูปแบบการเรียนรู้จากการปฏิบัติที่บูรณาการกับการทํางานตามอมตะโอวาท
      งานหนักไม่เคยฆ่าคน มุ่งให้ผู้เรียน มีทักษะการเรียนรู้ตลอดชีวิต
      สามารถพัฒนาทักษะเดิม สร้างเสริมทักษะใหม่ มีวิธีคิดของการเป็นผู้ประกอบการ
      มีการใช้เทคโนโลยีดิจิทัลและการสื่อสาร
      มีความตระหนักต่อสังคมวัฒนธรรมและสิ่งแวดล้อม
      ยึดมั่นในความสัมพันธ์ระหว่างมหาวิทยาลัยกับชุมชน
      ตามจุดยืนของมหาวิทยาลัยแม่โจ้ ที่ว่า มหาวิทยาลัยแห่งชีวิต ปรัชญาหลักสูตรฯ
      จัดการศึกษาเพื่อการพัฒนาเทคโนโลยี และส่งเสริมการสร้างนวัตกรรม
      เรียนรู้จากการปฏิบัติที่บูรณาการกับการทำงาน
      มุ่งให้ผู้เรียนมีความสามารถด้านวิชาการและวิชาชีพทางด้านวิทยาการคอมพิวเตอร์
      มีทักษะการเรียนรู้ตลอดชีวิต มีวิธีคิดของการเป็นผู้ประกอบการ
      มีความตระหนักต่อสังคม วัฒนธรรมและสิ่งแวดล้อม ตามจุดยืนของมหาวิทยาลัยแม่โจ้
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style></style>
